{
  "peft_type": "LORA",
  "task_type": "CAUSAL_LM",
  "inference_mode": false,
  "r": 16,
  "target_modules": [
    "q_proj",
    "v_proj",
    "k_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "bias": "none",
  "use_gradient_checkpointing": "",
  "random_state": 42,
  "fan_in_fan_out": false,
  "enable_lora": null,
  "merge_weights": false
}